{
  "ir_version": "0.1.0",
  "project": {
    "id": "myhome-local-finance-evidence",
    "name": "MyHome Local Finance Evidence",
    "visibility": "internal",
    "tags": ["internal-tooling", "local-first", "finance", "fixture-only", "plan-only"],
    "metadata": {
      "summary": "Public-safe contract for verifying plan-only monthly readiness and indirect receipts; no credentials, account identifiers, holdings, transactions, or revenue values."
    }
  },
  "contexts": [
    {
      "id": "context:local_finance_evidence",
      "name": "Local Finance Evidence Context",
      "kind": "bounded_context",
      "owns": [
        "requirement:receipts_converge",
        "requirement:monthly_readiness_converges",
        "capability:evidence_verification",
        "capability:readiness_verification",
        "policy:no_external_writes",
        "policy:no_credentials_or_network",
        "policy:monthly_order",
        "policy:receipt_integrity",
        "policy:fail_closed",
        "command:verify_evidence",
        "command:verify_readiness",
        "fsm:local_finance_evidence"
      ]
    }
  ],
  "requirements": [
    {
      "id": "requirement:receipts_converge",
      "name": "Indirect receipts converge",
      "description": "Ledger, portfolio, revenue, and shorts fixture or plan-only receipts converge into one month-bound aggregate hash or a bounded failure state.",
      "satisfied_by": ["fsm:local_finance_evidence", "policy:no_external_writes", "policy:receipt_integrity", "policy:fail_closed"],
      "visibility": "internal",
      "tags": ["monthly", "reliability", "evidence"]
    },
    {
      "id": "requirement:monthly_readiness_converges",
      "name": "Monthly readiness plans converge",
      "description": "Ledger day 2, portfolio day 3, and revenue day 5 plan-only schedules converge before Jarvis verifies evidence, without reading credentials or activating any connector.",
      "satisfied_by": ["fsm:local_finance_evidence", "policy:no_credentials_or_network", "policy:monthly_order", "policy:fail_closed"],
      "visibility": "internal",
      "tags": ["monthly", "readiness", "plan-only"]
    }
  ],
  "capabilities": [
    {
      "id": "capability:evidence_verification",
      "name": "Evidence verification",
      "kind": "runtime",
      "owner": "context:local_finance_evidence",
      "provides": ["command:verify_evidence"],
      "visibility": "internal",
      "tags": ["verification", "read-only"]
    },
    {
      "id": "capability:readiness_verification",
      "name": "Connection readiness verification",
      "kind": "runtime",
      "owner": "context:local_finance_evidence",
      "provides": ["command:verify_readiness"],
      "visibility": "internal",
      "tags": ["verification", "plan-only"]
    }
  ],
  "policies": [
    {
      "id": "policy:no_external_writes",
      "name": "No external writes",
      "kind": "security",
      "applies_to": ["fsm:local_finance_evidence", "transition:local_finance_evidence.readiness_to_ledger_plan", "transition:local_finance_evidence.schedule_to_ledger", "transition:local_finance_evidence.ledger_to_portfolio", "transition:local_finance_evidence.portfolio_to_revenue", "transition:local_finance_evidence.revenue_to_shorts", "transition:local_finance_evidence.shorts_to_aggregate"],
      "visibility": "internal",
      "tags": ["fixture-only", "plan-only", "no-trade", "no-transfer", "no-upload"]
    },
    {
      "id": "policy:no_credentials_or_network",
      "name": "No credential reads or network",
      "kind": "security",
      "applies_to": ["transition:local_finance_evidence.readiness_to_ledger_plan", "transition:local_finance_evidence.ledger_plan_to_portfolio_plan", "transition:local_finance_evidence.portfolio_plan_to_revenue_plan", "transition:local_finance_evidence.revenue_plan_to_schedule"],
      "visibility": "internal",
      "tags": ["plan-only", "public-config", "no-keychain", "no-network"]
    },
    {
      "id": "policy:monthly_order",
      "name": "Monthly fail-closed order",
      "kind": "runtime",
      "applies_to": ["state:local_finance_evidence.schedule_verified"],
      "visibility": "internal",
      "tags": ["day-2", "day-3", "day-5", "asia-seoul"]
    },
    {
      "id": "policy:receipt_integrity",
      "name": "Receipt integrity",
      "kind": "security",
      "applies_to": ["fsm:local_finance_evidence", "command:verify_evidence"],
      "visibility": "internal",
      "tags": ["sha256", "month-bound", "tamper-evident"]
    },
    {
      "id": "policy:fail_closed",
      "name": "Fail closed",
      "kind": "runtime",
      "applies_to": ["state:local_finance_evidence.blocked"],
      "visibility": "internal",
      "tags": ["recovery", "diagnostic"]
    }
  ],
  "commands": [
    {
      "id": "command:verify_evidence",
      "name": "Verify indirect evidence",
      "capability": "capability:evidence_verification",
      "visibility": "internal",
      "tags": ["deterministic", "read-only"]
    },
    {
      "id": "command:verify_readiness",
      "name": "Verify monthly connection readiness",
      "capability": "capability:readiness_verification",
      "visibility": "internal",
      "tags": ["deterministic", "plan-only"]
    }
  ],
  "fsms": [
    {
      "id": "fsm:local_finance_evidence",
      "name": "LocalFinanceEvidenceFSM",
      "context": "context:local_finance_evidence",
      "visibility": "internal",
      "tags": ["monthly", "tamper-evident"],
      "defined_at": {
        "uri": "examples/local-finance/local-finance.raid.json",
        "range": {"start_line": 91, "end_line": 133}
      },
      "states": [
        {"id": "idle", "kind": "atomic", "initial": true},
        {"id": "readiness_check", "kind": "atomic"},
        {"id": "ledger_plan", "kind": "atomic"},
        {"id": "portfolio_plan", "kind": "atomic"},
        {"id": "revenue_plan", "kind": "atomic"},
        {"id": "schedule_verified", "kind": "atomic"},
        {"id": "ledger_receipt", "kind": "atomic"},
        {"id": "portfolio_receipt", "kind": "atomic"},
        {"id": "revenue_receipt", "kind": "atomic"},
        {"id": "shorts_receipt", "kind": "atomic"},
        {"id": "aggregate_verified", "kind": "atomic", "terminal": true, "terminal_semantics": "success"},
        {"id": "blocked", "kind": "atomic", "terminal": true, "terminal_semantics": "failed"}
      ],
      "events": [
        {"id": "verify_requested", "name": "verify requested", "kind": "external"},
        {"id": "plan_failed", "name": "plan failed", "kind": "error"},
        {"id": "readiness_failed", "name": "readiness failed", "kind": "error"},
        {"id": "receipt_failed", "name": "receipt failed", "kind": "error"}
      ],
      "guards": [],
      "actions": [],
      "transitions": [
        {"id": "idle_to_readiness", "from": "idle", "to": "readiness_check", "on": "verify_requested", "guards": [], "actions": []},
        {"id": "readiness_to_ledger_plan", "from": "readiness_check", "to": "ledger_plan", "guards": [], "actions": [], "requires": ["policy:no_external_writes", "policy:no_credentials_or_network"]},
        {"id": "readiness_to_blocked", "from": "readiness_check", "to": "blocked", "on": "readiness_failed", "guards": [], "actions": [], "requires": ["policy:fail_closed"]},
        {"id": "ledger_plan_to_portfolio_plan", "from": "ledger_plan", "to": "portfolio_plan", "guards": [], "actions": [], "requires": ["policy:no_external_writes", "policy:no_credentials_or_network"]},
        {"id": "ledger_plan_to_blocked", "from": "ledger_plan", "to": "blocked", "on": "plan_failed", "guards": [], "actions": [], "requires": ["policy:fail_closed"]},
        {"id": "portfolio_plan_to_revenue_plan", "from": "portfolio_plan", "to": "revenue_plan", "guards": [], "actions": [], "requires": ["policy:no_external_writes", "policy:no_credentials_or_network"]},
        {"id": "portfolio_plan_to_blocked", "from": "portfolio_plan", "to": "blocked", "on": "plan_failed", "guards": [], "actions": [], "requires": ["policy:fail_closed"]},
        {"id": "revenue_plan_to_schedule", "from": "revenue_plan", "to": "schedule_verified", "guards": [], "actions": [], "requires": ["policy:no_external_writes", "policy:no_credentials_or_network", "policy:monthly_order"]},
        {"id": "revenue_plan_to_blocked", "from": "revenue_plan", "to": "blocked", "on": "plan_failed", "guards": [], "actions": [], "requires": ["policy:fail_closed"]},
        {"id": "schedule_to_ledger", "from": "schedule_verified", "to": "ledger_receipt", "guards": [], "actions": [], "requires": ["policy:no_external_writes", "policy:receipt_integrity", "policy:monthly_order"]},
        {"id": "schedule_to_blocked", "from": "schedule_verified", "to": "blocked", "on": "plan_failed", "guards": [], "actions": [], "requires": ["policy:fail_closed"]},
        {"id": "ledger_to_portfolio", "from": "ledger_receipt", "to": "portfolio_receipt", "guards": [], "actions": [], "requires": ["policy:no_external_writes", "policy:receipt_integrity"]},
        {"id": "ledger_to_blocked", "from": "ledger_receipt", "to": "blocked", "on": "receipt_failed", "guards": [], "actions": [], "requires": ["policy:fail_closed"]},
        {"id": "portfolio_to_revenue", "from": "portfolio_receipt", "to": "revenue_receipt", "guards": [], "actions": [], "requires": ["policy:no_external_writes", "policy:receipt_integrity"]},
        {"id": "portfolio_to_blocked", "from": "portfolio_receipt", "to": "blocked", "on": "receipt_failed", "guards": [], "actions": [], "requires": ["policy:fail_closed"]},
        {"id": "revenue_to_shorts", "from": "revenue_receipt", "to": "shorts_receipt", "guards": [], "actions": [], "requires": ["policy:no_external_writes", "policy:receipt_integrity"]},
        {"id": "revenue_to_blocked", "from": "revenue_receipt", "to": "blocked", "on": "receipt_failed", "guards": [], "actions": [], "requires": ["policy:fail_closed"]},
        {"id": "shorts_to_aggregate", "from": "shorts_receipt", "to": "aggregate_verified", "guards": [], "actions": [], "requires": ["policy:no_external_writes", "policy:receipt_integrity"]},
        {"id": "shorts_to_blocked", "from": "shorts_receipt", "to": "blocked", "on": "receipt_failed", "guards": [], "actions": [], "requires": ["policy:fail_closed"]}
      ]
    }
  ],
  "compositions": [],
  "projections": [
    {
      "id": "view:runtime",
      "kind": "projection",
      "source": "fsm:local_finance_evidence",
      "show": ["states", "transitions", "events", "requirements", "policies", "capabilities"],
      "filters": {"unreachable": false}
    }
  ],
  "derivations": [],
  "artifacts": [],
  "diagnostics": []
}
