{
  "ir_version": "0.1.0",
  "project": {"id": "runscope", "name": "RunScope"},
  "fsms": [
    {
      "id": "fsm:runtime",
      "name": "RuntimeFSM",
      "defined_at": {"uri": "lisp/runtime/runscope.lisp", "range": {"start_line": 4, "end_line": 16}},
      "states": [
        {"id": "idle", "kind": "atomic", "initial": true},
        {"id": "starting", "kind": "atomic"},
        {"id": "running", "kind": "atomic"},
        {"id": "completed", "kind": "atomic", "terminal": true, "terminal_semantics": "success"},
        {"id": "failed", "kind": "atomic", "terminal": true, "terminal_semantics": "failed"}
      ],
      "events": [
        {"id": "start_requested", "kind": "external"},
        {"id": "start_failed", "kind": "error"}
      ],
      "transitions": [
        {"id": "idle_to_starting", "from": "idle", "to": "starting", "on": "start_requested"},
        {"id": "starting_to_running", "from": "starting", "to": "running"},
        {"id": "starting_to_failed", "from": "starting", "to": "failed", "on": "start_failed"},
        {"id": "running_to_completed", "from": "running", "to": "completed"}
      ]
    },
    {
      "id": "fsm:agent",
      "name": "AgentFSM",
      "defined_at": {"uri": "lisp/runtime/runscope.lisp", "range": {"start_line": 19, "end_line": 34}},
      "states": [
        {"id": "idle", "kind": "atomic", "initial": true},
        {"id": "planning", "kind": "atomic"},
        {"id": "acting", "kind": "atomic"},
        {"id": "waiting", "kind": "atomic"},
        {"id": "completed", "kind": "atomic", "terminal": true, "terminal_semantics": "success"},
        {"id": "failed", "kind": "atomic", "terminal": true, "terminal_semantics": "failed"}
      ],
      "events": [
        {"id": "plan_requested", "kind": "internal"},
        {"id": "action_completed", "kind": "internal"},
        {"id": "action_failed", "kind": "error"}
      ],
      "transitions": [
        {"id": "idle_to_planning", "from": "idle", "to": "planning", "on": "plan_requested"},
        {"id": "planning_to_acting", "from": "planning", "to": "acting"},
        {"id": "acting_to_waiting", "from": "acting", "to": "waiting", "on": "action_completed"},
        {"id": "waiting_to_completed", "from": "waiting", "to": "completed"},
        {"id": "acting_to_failed", "from": "acting", "to": "failed", "on": "action_failed"}
      ]
    },
    {
      "id": "fsm:workspace",
      "name": "WorkspaceFSM",
      "defined_at": {"uri": "lisp/runtime/runscope.lisp", "range": {"start_line": 37, "end_line": 51}},
      "states": [
        {"id": "clean", "kind": "atomic", "initial": true},
        {"id": "dirty", "kind": "atomic"},
        {"id": "syncing", "kind": "atomic"},
        {"id": "synced", "kind": "atomic", "terminal": true, "terminal_semantics": "success"},
        {"id": "conflict", "kind": "atomic", "terminal": true, "terminal_semantics": "failed"}
      ],
      "events": [
        {"id": "file_changed", "kind": "external"},
        {"id": "sync_requested", "kind": "internal"},
        {"id": "sync_completed", "kind": "internal"},
        {"id": "sync_conflict", "kind": "error"}
      ],
      "transitions": [
        {"id": "clean_to_dirty", "from": "clean", "to": "dirty", "on": "file_changed"},
        {"id": "dirty_to_syncing", "from": "dirty", "to": "syncing", "on": "sync_requested"},
        {"id": "syncing_to_synced", "from": "syncing", "to": "synced", "on": "sync_completed"},
        {"id": "syncing_to_conflict", "from": "syncing", "to": "conflict", "on": "sync_conflict"}
      ]
    }
  ],
  "contexts": [
    {"id": "context:runtime", "name": "Runtime Context", "kind": "bounded_context", "owns": ["fsm:runtime", "fsm:agent", "fsm:workspace", "composition:runscope"]}
  ],
  "compositions": [
    {"id": "composition:runscope", "name": "RunScopeFSM", "kind": "product", "inputs": ["fsm:runtime", "fsm:agent", "fsm:workspace"], "state_space": {"kind": "lazy", "max_materialized_states": 48}, "conflict_policy": {"nondeterminism": "diagnostic", "unreachable": "hide_by_default"}, "tags": ["runtime", "lazy", "lisp-ssot"]}
  ],
  "projections": [
    {"id": "view:runtime", "kind": "projection", "source": "fsm:runtime", "show": ["states", "transitions", "events", "artifacts"]},
    {"id": "view:agent", "kind": "projection", "source": "fsm:agent", "show": ["states", "transitions", "events", "artifacts"]},
    {"id": "view:workspace", "kind": "projection", "source": "fsm:workspace", "show": ["states", "transitions", "events", "artifacts"]},
    {"id": "view:runscope", "kind": "projection", "source": "composition:runscope", "show": ["states", "transitions", "events", "artifacts", "coverage"], "filters": {"reachable_only": true}}
  ],
  "derivations": [
    {"id": "derivation:lisp_runtime_codegen", "source": "context:runtime", "rule": {"id": "fsm_codegen", "kind": "codegen", "generator": "dslraid-codegen", "version": "0.1.0"}, "targets": [{"artifact": "artifact:runtime_fsm.rs", "role": "generated"}]}
  ],
  "artifacts": [
    {"id": "artifact:runtime_fsm.rs", "kind": "generated", "path": "generated/runtime_fsm.rs", "generated_by": "derivation:lisp_runtime_codegen", "visibility": "public", "tags": ["generated", "rust", "lisp-ssot"]}
  ],
  "diagnostics": []

}
